help_title=Ajuda
help_content=<p>O processo de inclus\u00e3o de acessibilidade requer, inicialmente, a conscientiza\u00e7\u00e3o e o treinamento dos desenvolvedores sobre a import\u00e2ncia em implementar esse requisito em seus artefatos. Al\u00e9m disso, os detalhes espec\u00edficos, que precisam ser levados em considera\u00e7\u00e3o no desenvolvimento de uma solu\u00e7\u00e3o acess\u00edvel, exige que os desenvolvedores conhe\u00e7am tecnologias espec\u00edficas de acessibilidade.</p><p>Nesse sentido, conceber mecanismos que apoiem o desenvolvimento de elementos acess\u00edveis faz-se necess\u00e1rio e o tema precisa ser melhor explorado. Assim,  o AMeG foi desenvolvido com o objetivo de orientar os projetistas na cria\u00e7\u00e3o de menus Web acess\u00edveis, uma vez que podem causar grande impacto na intera\u00e7\u00e3o e navega\u00e7\u00e3o pela aplica\u00e7\u00e3o.</p><p>A acessibilidade presente nos c\u00f3digos gerados pela AMeG est\u00e3o fundamentados nas recomenda\u00e7\u00f5es de acessibilidade fornecidos pela <em>Web Content Acessibility Guidelines</em> (WCAG) 2.O, bem como as propriedades referentes a este elemento estabelecidas pelo ARIA 1.0.</p>
help_message=A seguir encontram-se diversos t\u00f3picos de ajuda para a utiliza\u00e7\u00e3o da AWMo. Selecione o link relacionado ao tema no qual voc\u00ea est\u00e1 buscando ajuda.
help_navigation_title=Navega\u00e7\u00e3o
help_assistive_title=Acessibilidade
help_main_page_title=P\u00e1gina inicial
help_amenu_title=A linguagem AMenu
help_amenu_content=<p>A linguagem AMenu (<em>Accessible Menu</em>) foi criada com o objetivo de modelar o dom\u00ednio de menus navega\u00e7\u00e3o Web em alto n\u00edvel de abstra\u00e7\u00e3o. Essa linguagem constitui a base para constru\u00e7\u00e3o de modelos de menus Web em geral, que por sua vez servir\u00e3o como entrada para esta ferramenta, na qual produzir\u00e1 como sa\u00edda menus Web acess\u00edveis.</p><p>A AMenu foi implementada utilizando o Xtext, podendo ser facilmente estendida para abstrair novas propriedades que por ventura venham a se tornar necess\u00e1rias. Apesar de sua simplicidade, a AMenu \u00e9 suficiente para dar origem ao c\u00f3digo completo de um menu de navega\u00e7\u00e3o Web acess\u00edvel. </p><p>A figura abaixo apresenta o metamodelo conceitual da AMenu:</p>
help_create_menu_title=Como criar um novo modelo de menu
        help_create_menu_content=<p>Um menu cont\u00e9m 7 propriedades b\u00e1sicas, sendo obrigat\u00f3rio somente as propriedades, "type" e "items". </p><p>A defini\u00e7\u00e3o de todos os atributos sempre s\u00e3o formadas pelo nome da propriedade, seguido de "=", seu respectivo valor e ";" para finalizar. <em>Ex.: type = dropdown;</em></p>
help_features_menu_title=Propriedades do menu:
help_features_menu_content=<ul><li><strong>id &ndash; </strong>Define um identificador para o menu. Todo identificador deve come\u00e7ar por uma letra ou "_", seguido de uma ou mais letras, n\u00fameros ou "_". Os identificadores s\u00e3o exclusivos, ou seja, n\u00e3o podem se repetir.</li><li><strong>type &ndash; </strong>Define o tipo de menu referente a este modelo. As op\u00e7\u00f5es s\u00e3o dropdown, flyout ou accordion.</li><li><strong>position &ndash; </strong>Define a posi\u00e7\u00e3o que o menu dever\u00e1 aparecer na aplica\u00e7\u00e3o. As op\u00e7\u00e3o s\u00e3o left, center ou right.</li><li><strong>style &ndash; </strong>Define o estilo de apresenta\u00e7\u00e3o do menu. As op\u00e7\u00f5es s\u00e3o simple e complex.</li><li><strong>class &ndash; </strong>Define o nome das classes de CSS que o menu pode ter. O valor deve ser colocado entre aspas duplas.</li><li><strong>config &ndash; </strong>Define algumas configura\u00e7\u00f5es de layout que o menu pode assumir, diferentes das configura\u00e7\u00f5es iniciais. Seus valores devem vir entre colchetes "[ ]" e separados por virgula ",". </li><li><strong>items &ndash; </strong>Define os itens que constituem o menu. Seus valores devem vir entre colchetes "[ ]" e separados por virgula ",". </li></ul>
help_features_config_title=Propriedades das configura\u00e7\u00f5es do menu (config):
help_features_config_content=<p>As cores s\u00e3o formadas por "#" seguida de 3 ou 6 d\u00edgitos hexadecimais. <em>Ex.: #FFF (branco) ou #000000 (preto).</em></p><ul><li><strong>top-background &ndash; </strong>Define a cor de fundo dos itens do menu principal.</li><li><strong>top-background-hover &ndash; </strong>Define a cor de fundo do item do menu principal quando este receber foco ou estiver aberto.</li><li><strong>top-color &ndash; </strong>Define a cor do texto dos itens do menu principal.</li><li><strong>top-colo-hover &ndash; </strong>Define a cor do texto do item do menu principal quando este receber foco ou estiver aberto.</li><li><strong>top-border &ndash; </strong>Define a cor da borda do menu principal.</li><li><strong>children-background &ndash; </strong>Define a cor de fundo dos itens dos submenus.</li><li><strong>children-background-hover &ndash; </strong>Define a cor de fundo do item do submenu quando este receber foco ou estiver aberto.</li><li><strong>children-color &ndash; </strong>Define a cor do texto dos itens dos submenus.</li><li><strong>children-colo-hover &ndash; </strong>Define a cor do texto do item do submenu quando este receber foco ou estiver aberto.</li><li><strong>children-border &ndash; </strong>Define a cor da borda dos submenus.</li></ul>
help_features_items_title=Propriedades dos itens (items):
help_features_items_content=<p>As propriedades que comp\u00f5e um item devem estar entre chaves "{ }", sendo obrigat\u00f3rio as propriedades "label" e "action". Contudo, a obrigatoriedade do "action" dependendo do contexto.</p><ul><li><strong>id &ndash; </strong>Define um identificador para o item. Todo identificador deve come\u00e7ar por uma letra ou "_", seguido de uma ou mais letras, n\u00fameros ou "_". Os identificadores s\u00e3o exclusivos, ou seja, n\u00e3o podem se repetir.</li><li><strong>class &ndash; </strong>Define o nome das classes de CSS que o item pode ter. O valor deve ser colocado entre aspas duplas.</li><li><strong>action &ndash; </strong>Define a URL ou a a\u00e7\u00e3o que o item ir\u00e1 executar . O valor deve ser colocado entre aspas duplas. Caso o item contenha um submenu associado, seu valor n\u00e3o \u00e9 obrigat\u00f3rio. </li><li><strong>label &ndash; </strong>Define o texto que descreve o conte\u00fado do item. O valor deve ser colocado entre aspas duplas.</li><li><strong>title &ndash; </strong>Define o  texto que descreve o conte\u00fado do item de forma mais completa. O valor deve ser colocado entre aspas duplas. Ex. O significado de uma abreviatura.</li><li><strong>dir &ndash; </strong>Especifica a dire\u00e7\u00e3o que o texto do item deve ser lido. As op\u00e7\u00f5es s\u00e3o: ltr, rlt ou auto.</li><li><strong>target &ndash; </strong>Indica onde ser\u00e1 aberto o recurso (link ou script) vinculado ao item. As op\u00e7\u00f5es s\u00e3o: _self, _blank, _top ou _parent.</li><li><strong>icon &ndash; </strong>Define uma imagem par o item.</li><li><strong>submenu &ndash; </strong>Define um submenu para o item.</li></ul>
help_features_submenu_title=Propriedades do submenu (submenu):
help_features_submenu_content=<p>As propriedades que comp\u00f5e o submenu devem estar entre chaves "{ }", sendo obrigat\u00f3rio a propriedade "items".</p><ul><li><strong>id &ndash; </strong>Define um identificador para o submenu. Todo identificador deve come\u00e7ar por uma letra ou "_", seguido de uma ou mais letras, n\u00fameros ou "_". Os identificadores s\u00e3o exclusivos, ou seja, n\u00e3o podem se repetir.</li><li><strong>class &ndash; </strong>Define o nome das classes de CSS que o submenu pode ter. O valor deve ser colocado entre aspas duplas.</li><li><strong>items &ndash; </strong>Define os itens que constituem o submenu. Seus valores devem vir entre colchetes "[ ]" e separados por virgula ",". </li></ul>
help_features_icon_title=Propriedades da imagem (icon):
help_features_icon_content=<p>As propriedades que comp\u00f5e a imagem devem estar entre chaves "{ }", sendo obrigat\u00f3rio as propriedades "text-alt" e "address".</p><ul><li><strong>id &ndash; </strong>Define um identificador para a imagem. Todo identificador deve come\u00e7ar por uma letra ou "_", seguido de uma ou mais letras, n\u00fameros ou "_". Os identificadores s\u00e3o exclusivos, ou seja, n\u00e3o podem se repetir.</li><li><strong>class &ndash; </strong>Define o nome das classes de CSS que a imagem pode ter. O valor deve ser colocado entre aspas duplas.</li><li><strong>position &ndash; </strong>Define a posi\u00e7\u00e3o que da imagem em rela\u00e7\u00e3o ao texto do item. As op\u00e7\u00e3o s\u00e3o left, center ou right.</li><li><strong>text-alt &ndash; </strong>Define o texto alternativo que descreve a imagem. O valor deve ser colocado entre aspas duplas. </li><li><strong>address &ndash; </strong>Define a URL onde a imagem est\u00e1 localizada.  O valor deve ser colocado entre aspas duplas.</li></ul>
help_example_menu_title=Exemplo de um modelo de menu Web
help_textual_title=Editor textual
help_textual_content=<p>O editor textual presente na AMeG faz uso da linguagem AMenu (<em>Acessible Menu</em>), a qual constitui a base para cria\u00e7\u00e3o de modelos de menus de navega\u00e7\u00e3o Web que abstraem as principais caracter\u00edsticas existentes nesse dom\u00ednio. A interface do editor textual \u00e9 preparada para intera\u00e7\u00e3o de qualquer perfil de usu\u00e1rio (com ou sem defici\u00eancia).</p><p>Ap\u00f3s o usu\u00e1rio inserir um modelo de menu com base na AMenu, \u00e9 poss\u00edvel a gera\u00e7\u00e3o de toda a estrutura de c\u00f3digo acess\u00edvel pronta para ser incorporada na aplica\u00e7\u00e3o final,  bem como todo o passo-a-passo de como utilizar os c\u00f3digos produzidos.</p>
help_graphical_title=Editor gr\u00e1fico
help_graphical_content=<p><em>Em desenvolvimento<em>.</p>
toTop=voltar ao topo
