save_button=Salvar menu
result_transformation_title=Resultado da Transforma\u00e7\u00e3o
result_transformation_text1=Os c\u00f3digos abaixo correspondem ao menu Web acess\u00edvel gerado com base nos dados fornecidos acima. Entretanto, customiza\u00e7\u00f5es externas das propriedades do c\u00f3digo CSS podem interferir e reduzir a acessibilidade.
result_transformation_text2=Assim, ap\u00f3s a customiza\u00e7\u00e3o do CSS, recomenda-se fortemente a reavalia\u00e7\u00e3o de acessibilidade do menu por meio do seguinte checklist
reuslt_transformation_use=Modo de usar menu acess\u00edvel gerado
click_here=Clique aqui
code_html=C\u00f3digo HTML
code_html_use=O c\u00f3digo HTML abaixo deve ser inserido em todas as p\u00e1ginas, no local em que o menu dever\u00e1 aparecer quando for renderizado no navegador.
code_html_copy= para copiar o c\u00f3digo HTML para o clipboard
code_css=C\u00f3digo CSS
code_css_use=O c\u00f3digo CSS pode ser utilizado de duas maneiras diferentes:
code_css_use_opc1=Arquivo com o c\u00f3digo externo
code_css_use_opc1_1=Baixar o arquivo com extens\u00e3o ".css"
code_css_use_opc1_2=Colocar o arquivo dentro da pasta que est\u00e1 a sua aplica\u00e7\u00e3o
code_css_use_opc1_3=Inserir o seguinte c\u00f3digo antes da tag </head> de todas as p\u00e1ginas que est\u00e3o o menu, trocando "PATH_CSS" pelo endere\u00e7o da pasta que est\u00e1 o arquivo ".css"
code_css_use_opc2=C\u00f3digo direto na p\u00e1gina
code_css_use_opc2_1=Copiar o c\u00f3digo gerado. 
code_css_use_opc2_2=Colar o conte\u00fado copiado antes da tag </head>, em todas as p\u00e1ginas que est\u00e3o o menu
code_css_copy=para copiar o c\u00f3digo CSS para o clipboard
code_js=C\u00f3digo Javascript
code_js_use=As funcionalidades de "acessibilidade" dependem da utiliza\u00e7\u00e3o da biblioteca de Javascript JQuery para que possam funcionar. O c\u00f3digo Javascript abaixo deve ser colocado antes da tag </head>, em todas as p\u00e1ginas que est\u00e3o o menu.
code_js_copy=para copiar o c\u00f3digo Javascript para o clipboard